function UserAgreement() {
    return (
        <div className=" bg-gray-300">
            <div className=" container mx-auto py-6">
                <h1 className=" text-center text-3xl">Пользовательское Соглашение</h1>

                <h2 className=" text-xl p-4">
                    
                    Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем "www.TheAlpaca.com" (далее The Alpaca или Администрация) с одной стороны и пользователем сайта с другой.
                    Сайт The Alpaca не является средством массовой информации.</h2>

                <h2 className=" text-xl p-4">
                    Используя сайт, Вы соглашаетесь с условиями данного соглашения.
                    Если Вы не согласны с условиями данного соглашения, не используйте сайт The Alpaca!
                </h2>

                <div className="my-6">
                    <h2 className=" text-xl p-4">Предмет соглашения</h2>
                    <ul className=" text-xl pl-7">
                        Администрация предоставляет пользователю право на размещение на сайте следующей информации:
                        <li className=" p-1 text-lg pl-8">
                            - Текстовой информации
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - Фотоматериалов
                        </li>
                    </ul>
                </div>

                <div className="my-6">
                    <h2 className=" text-xl p-4">Права и обязанности сторон</h2>
                    <ul className=" text-xl pl-7">
                        Пользователь имеет право:
                        <li className=" p-1 text-lg pl-8">
                            - осуществлять поиск информации на сайте
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - получать информацию на сайте
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - распространять информацию на сайте
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - комментировать контент, выложенный на сайте
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - использовать информацию сайта в личных некоммерческих целях
                        </li>
                    </ul>
                </div>

                <div className="my-6">
                    <ul className=" text-xl pl-7">
                        <h2 className=" text-xl p-4">Администрация имеет право:</h2>
                        <li className=" p-1 text-lg pl-8">
                            - по своему усмотрению и необходимости создавать, изменять, отменять правила
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - ограничивать доступ к любой информации на сайте
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - создавать, изменять, удалять информацию
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - удалять учетные записи
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - отказывать в регистрации без объяснения причин
                        </li>
                    </ul>
                </div>

                <div className="my-6">
                    <ul className=" text-xl pl-7">
                        <h2 className=" text-xl p-4">Пользователь обязуется:</h2>
                        <li className=" p-1 text-lg pl-8">
                            - не нарушать работоспособность сайта
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами
                        </li>
                    </ul>
                </div>

                <div className="my-6">
                    <h2 className=" text-xl p-4">Администрация обязуется:</h2>
                    <ul className=" text-xl pl-7">
                        <li className=" p-1 text-lg pl-8">- поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</li>
                        <li className=" p-1 text-lg pl-8">
                            - осуществлять разностороннюю защиту учетной записи Пользователя
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом
                        </li>
                    </ul>
                </div>


                <div className="my-6">
                    <ul className=" text-xl pl-7">
                        <h2 className=" text-xl p-4">Ответственность сторон</h2>
                        <li className=" p-1 text-lg pl-8">
                            - пользователь лично несет полную ответственность за распространяемую им информацию
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - администрация не несет никакой ответственности за достоверность информации, скопированной из других источников
                        </li>
                        <li className=" p-1 text-lg pl-8">

                            - администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами
                        </li>
                        <li className=" p-1 text-lg pl-8">
                            - в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса
                        </li>
                    </ul>
                </div>

                <div className="my-6">
                    <h2 className=" text-xl p-4">Условия действия Соглашения:</h2>
                    <p className=" text-lg pl-8">
                        Данное Соглашение вступает в силу при любом использовании данного сайта. <br />
                        Соглашение перестает действовать при появлении его новой версии. <br />
                        Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению. <br />
                        При изменении соглашения, в некоторых случаях, администрация может оповестить пользователей удобным для нее способом. <br />
                    </p>
                </div>























            </div>
        </div>);
}

export default UserAgreement;